In [1]:
#How to handle duplicate data

In [2]:
import pandas as pd

In [10]:
data={"Name":["a","b","c","d","a","c"],"Eng":[8,7,5,8,8,5],"Hindi":[2,3,4,5,2,6]}

In [11]:
df=pd.DataFrame(data)
df

  Name  Eng  Hindi
0    a    8      2
1    b    7      3
2    c    5      4
3    d    8      5
4    a    8      2
5    c    5      6

In [12]:
df.duplicated()

0    False
1    False
2    False
3    False
4     True
5    False
dtype: bool

In [13]:
# df["duplicate"]=df.duplicated()
# df

  Name  Eng  Hindi  duplicate
0    a    8      2      False
1    b    7      3      False
2    c    5      4      False
3    d    8      5      False
4    a    8      2       True
5    c    5      6      False

In [20]:
df=pd.DataFrame(data)
df

  Name  Eng  Hindi
0    a    8      2
1    b    7      3
2    c    5      4
3    d    8      5
4    a    8      2
5    c    5      6

In [21]:
# df.drop_duplicates(keep="first",inplace=True) actual way to do
# df

  Name  Eng  Hindi
0    a    8      2
1    b    7      3
2    c    5      4
3    d    8      5
5    c    5      6

In [22]:
 df.drop_duplicates(keep="first")

  Name  Eng  Hindi
0    a    8      2
1    b    7      3
2    c    5      4
3    d    8      5
5    c    5      6

In [23]:
df.drop_duplicates()

  Name  Eng  Hindi
0    a    8      2
1    b    7      3
2    c    5      4
3    d    8      5
5    c    5      6

In [24]:
dataset=pd.read_csv(r"C:\Users\HP\Downloads\loan (1).csv")
dataset.head(3)

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,Male,No,0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban,Y
1,LP001003,Male,Yes,1,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural,N
2,LP001005,Male,Yes,0,Graduate,Yes,3000,0.0,66.0,360.0,1.0,Urban,Y

In [25]:
dataset.duplicated()

0      False
1      False
2      False
3      False
4      False
       ...
609    False
610    False
611    False
612    False
613    False
Length: 614, dtype: bool

In [27]:
dataset.shape

(614, 13)

In [29]:
dataset.drop_duplicates(keep="first",inplace=True)

In [31]:
dataset.shape

(614, 13)

In [ ]:
#No duplicate row found